//final 정의와 용도
//ㅇ정의
// -  '금지'의 의미를 가지는 지정자다. 
//ㅇ 용도
// - 클래승 : 상속을 금지한다. 
// - 멤버 메서드 : 오버라이딩을 금지한다. 
// - 멤버 변수 : 값 변경을 금지한다(상수로 사용).
// 
//인터페이스 정의
// interface 키워드로 선언된 추상 클래스
//인터페이스 트징
// - 추상클래스가 발전한 개념이다. 
// - 인스턴스 생성이 불가능하다.
// - upcasting 탕입으로 사용할 수 있다. 
// - 멤버로는 상수, 추상 메서드만 헤용한다. 
// - 하위 클래스와의 관계는 implements이다. 
// - 하위 클래스에서는 여러 인터페이스를 동시에 implements 할 수 있다. 
// - 자바의 단일 상속 기능을 보완할 수 있다. 
//인터페이스 용도
//- 기능만을 하위 클래스에 강제하기 위해 사용된다. 
//
//리모델링 법규집
//	1조1항 : 모든 건물에는 비상구가 있어야 한다. 
//	1조 2항 : 기본 방의 개수는 변경할 수없다. 
//	1조 3항 : 모든 건물에는 하나 이상의 화장실이 설치되어 있어야 한다.
//
//- 다중 상속이 안되기 때문에 interface를 사용함

package java0605;

public class 인터페이스 {

}
